
# 文法终结符
Terminator = {'(',')','{','}','describe','type','*','id','[',']','digit','/','+','-','=',',',';','string','for','<','>','==','!=','++','--','if','else','return'}

# 非终结符
no_terminal = {"<函数定义>", "<修饰词闭包>", "<类型>", "<变量>", "<参数声明>", "<函数块>", "<修饰词>", "<取地址>", 
"<星号闭包>", "<星号>", "<标志符>", "<数组下标>", "<因式>", "<表达式>", "<数字>", "<因子>", "<项>", "<因式递归>",
 "<声明>", "<声明闭包>", "<赋初值>", "<右值>", "<多个数据>", "<数字闭包>", "<声明语句闭包>", "<函数块闭包>",
  "<声明语句>", "<赋值函数>", "<for循环>", "<条件语句>", "<函数返回>", "<赋值或函数调用>", "<参数列表>", 
  "<参数>", "<参数闭包>", "<字符串>", "<逻辑表达式>", "<后缀表达式>", "<逻辑运算符>", "<后缀运算符>", "<否则语句>"}

# first集合
First = {}
First["<函数定义>"] = ["describe","type"]
First["<修饰词闭包>"] = ["describe"]
First["<类型>"] = ["type"]
First["<变量>"] = ["id"]
First["<参数声明>"] = ["describe type"]
First["<函数块>"] = ["describe", "type", "id", "for", "if", "return"]
First["<修饰词>"] = ["describe"]
First["<取地址>"] = ["*"]
First["<星号闭包>"] = ["*"]
First["<星号>"] = ["*"]
First["<标志符>"] = ["id"]
First["<数组下标>"] = ["[", "$"]
First["<因式>"] = ["(", "id", "digit"]
First["<表达式>"] = ["(", "id", "digit"]
First["<数字>"] = ["digit"]
First["<因子>"] = ["(","id", "digit"]
First["<项>"] = ["+", "-", "$"]
First["<因式递归>"] = ["*", "/", "$"]
First["<声明>"] = ["describe", "type"]
First["<声明闭包>"] = [","]
First["<赋初值>"] = ["="]
First["<右值>"] = ["(", "id", "digit", "{"]
First["<多个数据>"] = ["digit"]
First["<数字闭包>"] = [","]
First["<声明语句闭包>"] = ["describe", "type"]
First["<函数块闭包>"] = ["id", "for", "if", "return"]
First["<声明语句>"] = ["describe", "type"]
First["<赋值函数>"] = ["id"]
First["<for循环>"] = ["for"]
First["<条件语句>"] = ["if"]
First["<函数返回>"] = ["return"]
First["<赋值或函数调用>"] = ["=", "("]
First["<参数列表>"] = ["id", "digit", "string"]
First["<参数>"] = ["id","digit", "string"]
First["<参数闭包>"] = [","]
First["<字符串>"] = ["string"]
First["<逻辑表达式>"] = ["(", "id", "digit"]
First["<后缀表达式>"] = ["id"]
First["<逻辑运算符>"] = ["<", ">", "==", "!="]
First["<后缀运算符>"] = ["++", "--"]
First["<否则语句>"] = ["else", "$"]

# follow集合
Follow = {}
Follow["<函数定义>"] = ["#"]
Follow["<修饰词闭包>"] = ["type"]
Follow["<类型>"] = ["id"]
Follow["<变量>"] = ["(","]",")",",",";","<",">","==","!=","+","-","*","/", "=", "++","--"]
Follow["<参数声明>"] = [")"]
Follow["<函数块>"] = ["}"]
Follow["<修饰词>"] = ["type","describe"]
Follow["<取地址>"] = ["id"]
Follow["<星号闭包>"] = ["id"]
Follow["<星号>"] = ["id","*"]
Follow["<标志符>"] = ["(","]",")",",",";","<",">","==","!=","+","-","*","/", "=", "[", "++","--","["]
Follow["<数组下标>"] = ["(","]",")",",",";","<",">","==","!=","+","-","*","/", "=", "[","++","--"]
Follow["<因式>"] = ["]",")",",",";","<",">","==","!=","+","-","*","/"]
Follow["<表达式>"] = [")",",",";","<",">","==","!="]
Follow["<数字>"] = ["]",")",",",";","<",">","==","!=","+","-","*","/","}"]
Follow["<因子>"] = [")",",",";","<",">","==","!=","+","-"]
Follow["<项>"] = [")",",",";","<",">","==","!="]
Follow["<因式递归>"] = [")",",",";","<",">","==","!=","+","-"]
Follow["<声明>"] = [")",",",";"]
Follow["<声明闭包>"] = [")"]
Follow["<赋初值>"] = [")",",",";"]
Follow["<右值>"] = [")",",",";"]
Follow["<多个数据>"] = ["}"]
Follow["<数字闭包>"] = ["}"]
Follow["<声明语句闭包>"] = ["}","id","for","if","return"]
Follow["<函数块闭包>"] = ["}"]
Follow["<声明语句>"] = ["}","id","for","if","return","describe","type"]
Follow["<赋值函数>"] = ["}","id","for","if","return","(","digit"]
Follow["<for循环>"] = ["}","id","for","if","return"]
Follow["<条件语句>"] = ["}","id","for","if","return"]
Follow["<函数返回>"] = ["}","id","for","if","return"]
Follow["<赋值或函数调用>"] = ["}","id","for","if","return","(","digit"]
Follow["<参数列表>"] = [")"]
Follow["<参数>"] = [")",","]
Follow["<参数闭包>"] = [")"]
Follow["<字符串>"] = [")",","]
Follow["<逻辑表达式>"] = [";",")"]
Follow["<后缀表达式>"] = [")"]
Follow["<逻辑运算符>"] = ["(","id","digit"]
Follow["<后缀运算符>"] = [")"]
Follow["<否则语句>"] = ["}","id","for","if","return"]




